Resources.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-09-01 Fri 01:40 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tamara Temple" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#resources-for-working-with-git">1. Resources for working with Git</a>
<ul>
<li><a href="#websites">1.1. Websites</a>
<ul>
<li><a href="#more-on-just-command-line">1.1.1. More on just command line</a></li>
</ul>
</li>
<li><a href="#cheat-sheets">1.2. Cheat Sheets</a>
<ul>
<li><a href="#command-line">1.2.1. Command line</a></li>
</ul>
</li>
<li><a href="#gui-tools">1.3. GUI Tools</a></li>
<li><a href="#editor-integrations">1.4. Editor Integrations</a>
<ul>
<li><a href="#atom">1.4.1. Atom</a></li>
<li><a href="#sublime-text-2-3">1.4.2. Sublime Text 2 / 3</a></li>
<li><a href="#emacs">1.4.3. Emacs</a></li>
<li><a href="#vim">1.4.4. VIM</a></li>
<li><a href="#jetbrains-ides">1.4.5. JetBrains IDEs</a></li>
</ul>
</li>
<li><a href="#online-courses">1.5. Online Courses</a></li>
<li><a href="#other-resources">1.6. Other Resources</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org551df36" class="outline-2">
<h2 id="resources-for-working-with-git"><a id="org551df36"></a><span class="section-number-2">1</span> Resources for working with Git</h2>
<div class="outline-text-2" id="text-resources-for-working-with-git">
</div>

<div id="outline-container-orgf9fd738" class="outline-3">
<h3 id="websites"><a id="orgf9fd738"></a><span class="section-number-3">1.1</span> Websites</h3>
<div class="outline-text-3" id="text-websites">
<ul class="org-ul">
<li><a href="https://git-scm.com/doc">official documentation</a></li>
<li><a href="https://help.github.com/articles/set-up-git/">Github help</a></li>
<li><a href="https://www.learnenough.com/git-tutorial">Learn Enough Git to be
Dangerous</a></li>
</ul>
</div>

<div id="outline-container-orgb199333" class="outline-4">
<h4 id="more-on-just-command-line"><a id="orgb199333"></a><span class="section-number-4">1.1.1</span> More on just command line</h4>
<div class="outline-text-4" id="text-more-on-just-command-line">
<ul class="org-ul">
<li><a href="https://www.learnenough.com/command-line-tutorial">Learn Enough
Command Line to Be Dangerous</a></li>
<li><a href="https://explainshell.com">Explain Shell</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2789335" class="outline-3">
<h3 id="cheat-sheets"><a id="org2789335"></a><span class="section-number-3">1.2</span> Cheat Sheets</h3>
<div class="outline-text-3" id="text-cheat-sheets">
<ul class="org-ul">
<li><a href="github-git-cheat-sheet.pdf">from Github</a></li>
<li><a href="gitlab-git-cheat-sheet.pdf">from Gitlab</a></li>
<li><a href="atlassian_get_cheatsheet.pdf">from Atlassian</a></li>
<li><a href="https://www.cheatography.com/samcollett/cheat-sheets/git/">Git
Cheat Sheet by SamCollett</a></li>
<li><a href="http://www.ndpsoftware.com/git-cheatsheet.html#loc=workspace;">Workspace
Git Cheatsheet</a></li>
</ul>
</div>

<div id="outline-container-org5fcd541" class="outline-4">
<h4 id="command-line"><a id="org5fcd541"></a><span class="section-number-4">1.2.1</span> Command line</h4>
<div class="outline-text-4" id="text-command-line">
<ul class="org-ul">
<li><a href="https://www.git-tower.com/blog/command-line-cheat-sheet/">Command
Line Cheat Sheet from Git Tower</a></li>
<li><a href="https://www.cheatography.com/davechild/cheat-sheets/linux-command-line/">Linux
Command Line Cheat Sheet by DaveChild</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb87e1d3" class="outline-3">
<h3 id="gui-tools"><a id="orgb87e1d3"></a><span class="section-number-3">1.3</span> GUI Tools</h3>
<div class="outline-text-3" id="text-gui-tools">
<p>
<i>For when the command line becomes all too much.</i>
</p>

<ul class="org-ul">
<li><a href="https://git-scm.com/downloads/guis">Official List of GUI tools</a></li>
<li><a href="https://www.sourcetreeapp.com/">SourceTree</a></li>
<li><a href="https://desktop.github.com/">Github Desktop</a></li>
<li><a href="https://www.git-tower.com/mac/">Tower</a></li>
<li><a href="https://git.wiki.kernel.org/index.php/InterfacesFrontendsAndTools">Unofficial
list of GUI tools</a></li>
</ul>
</div>
</div>

<div id="outline-container-org60deaaa" class="outline-3">
<h3 id="editor-integrations"><a id="org60deaaa"></a><span class="section-number-3">1.4</span> Editor Integrations</h3>
<div class="outline-text-3" id="text-editor-integrations">
</div>

<div id="outline-container-orgce3f74b" class="outline-4">
<h4 id="atom"><a id="orgce3f74b"></a><span class="section-number-4">1.4.1</span> Atom</h4>
<div class="outline-text-4" id="text-atom">
<ul class="org-ul">
<li><a href="http://blog.atom.io/2014/03/13/git-integration.html">Git
Integration - Atom Blog</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga52dc0a" class="outline-4">
<h4 id="sublime-text-2-3"><a id="orga52dc0a"></a><span class="section-number-4">1.4.2</span> Sublime Text 2 / 3</h4>
<div class="outline-text-4" id="text-sublime-text-2-3">
<ul class="org-ul">
<li><a href="https://sublimegit.readthedocs.io/en/latest/">SublimeGit</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgef24b20" class="outline-4">
<h4 id="emacs"><a id="orgef24b20"></a><span class="section-number-4">1.4.3</span> Emacs</h4>
<div class="outline-text-4" id="text-emacs">
<ul class="org-ul">
<li><a href="https://magit.vc/">Magit</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgae8dfa3" class="outline-4">
<h4 id="vim"><a id="orgae8dfa3"></a><span class="section-number-4">1.4.4</span> VIM</h4>
<div class="outline-text-4" id="text-vim">
<ul class="org-ul">
<li><a href="http://www.vim.org/scripts/script.php?script_id=2975">fugitive.vim</a></li>
<li><a href="http://www.vim.org/scripts/script.php?script_id=90">vcscommand.vim</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdf34ed9" class="outline-4">
<h4 id="jetbrains-ides"><a id="orgdf34ed9"></a><span class="section-number-4">1.4.5</span> JetBrains IDEs</h4>
<div class="outline-text-4" id="text-jetbrains-ides">
<p>
Nothing additional needed, all the fabulous JetBrains IDEs (WebStorm,
PyCharm, RubyMine, PhpStorm, etc) come with exceptional support for git.
</p>
</div>
</div>
</div>

<div id="outline-container-orgda8dbac" class="outline-3">
<h3 id="online-courses"><a id="orgda8dbac"></a><span class="section-number-3">1.5</span> Online Courses</h3>
<div class="outline-text-3" id="text-online-courses">
<ul class="org-ul">
<li><a href="http://learngitbranching.js.org/">Learn Git Branching</a></li>
</ul>

<p>
A really nifty online learning experience that walks you through how to
do branching and merging in git.
</p>

<ul class="org-ul">
<li><a href="https://www.shortcutfoo.com/app/dojos/git">Git commands and
shortcuts ShortcutFoo</a></li>
<li><a href="https://www.udemy.com/learning-git2/">Udemy.com: Learning Git</a></li>
<li><a href="https://www.lynda.com/Git-tutorials/Git-Essential-Training/100222-2.html">Lynda.com:
Git Essential Training</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd93470c" class="outline-3">
<h3 id="other-resources"><a id="orgd93470c"></a><span class="section-number-3">1.6</span> Other Resources</h3>
<div class="outline-text-3" id="text-other-resources">
<ul class="org-ul">
<li><a href="https://www.atlassian.com/git">Atlassian Git Tutorials</a> (Atlassian
are makers of BitBucket, another Git remote hosting service like
GitHub and GitLab)</li>

<li><a href="https://about.gitlab.com/2016/12/08/git-tips-and-tricks/">Git Tips
&amp; Tricks - GitLab</a></li>

<li><a href="https://github.com/gdiminneapolis/falling-in-love-with-git/wiki/The-%22Git-Dance%22">The
Git Dance</a></li>

<li><a href="http://nvie.com/posts/a-successful-git-branching-model/">Git Flow:
A successful Git branching model</a></li>

<li><a href="https://www.atlassian.com/git/tutorials/comparing-workflows">Git
Workflows and Tutorials</a></li>

<li><a href="https://docs.google.com/document/d/1liKkSCPcOXvc4QTSbvxqpOJjjfRhPlkMzOwwxMVfHpU/edit#heading=h.87j2thi29oi8">GitHub
30 Day Challenge Guide</a></li>
</ul>

<p>
Written by Prime Digital Academy's Scott Bromander, this is a document
to help you develop a practice of learning by using Git and Github to
track your learning.
</p>

<ul class="org-ul">
<li><a href="https://github.com/tamouse/gdi-starting-up">gdi-starting-up: A
quick set of steps to use when beginning a new project from scratch</a></li>
</ul>

<p>
A general set of guidelines to use when starting off a new project.
</p>

<ul class="org-ul">
<li><a href="https://hub.github.com/">hub: the command-line wrapper for git</a></li>
</ul>

<p>
Using hub, starting up a new project becomes pretty simple:
</p>

<div class="org-src-container">
<pre class="src src-sh">git init new_project
<span style="color: #f0e68c; font-weight: bold;">cd</span> new_project
hub create
<span style="color: #f0e68c; font-weight: bold;">echo</span> <span style="color: #61CE3C;">'# My New Awesome Project'</span> &gt; README.md
git add -A
git commit -m initial
git push -u origin HEAD
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tamara Temple</p>
<p class="date">Created: 2017-09-01 Fri 01:40</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
